Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures.UnableToIncludePartInMerge Property
 Attempt to merge this Part results in failure of boolean operation. Cannot compute combined geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToIncludePartInMerge { get; }
Public Shared ReadOnly Property UnableToIncludePartInMerge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToIncludePartInMerge {
	FailureDefinitionId^ get ();
}
static member UnableToIncludePartInMerge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace